/** @file
********************************************************************************
<PRE>
模块名: 基二时域快速傅立叶变换
文件名: FFT2.h
相关文件: FFT2.c
文件实现功能: 声明基二时域快速傅立叶变换相关函数
作者: 李光程
编译器版本: VS2015
编程方式: ANSI C语言编程
生成日期: 2016-1-8
--------------------------------------------------------------------------------
多线程安全性: <是/否>[，说明]
异常时安全性: <是/否>[，说明]
--------------------------------------------------------------------------------
备注: <其它说明>
--------------------------------------------------------------------------------
*******************************************************************************/
#ifndef _FFT2_
#define _FFT2_

#include <stdio.h>
#include <malloc.h>
#include <math.h>
#include "global.h"


/**
 * @brief 复数结构
 */
typedef struct COMPX
{
    double real; //!< 实部
    double imag; //!< 虚部
} COMPX;


void FFT2(COMPX * xin, int N);

#endif    //_FFT2_
